def duanwi():
    print('段位积分区间应在0~799之间')
    段位积分 = input('请输入您的段位积分：')
    段位积分 = int(段位积分)

    if 段位积分 >= 0 and 段位积分 <=99 :
        print('您的段位是：黑铁')
    elif 段位积分 >= 100 and 段位积分 <=199 :
        print('您的段位是：青铜')
    elif 段位积分 >= 200 and 段位积分 <=299 :
        print('您的段位是：白银')
    elif 段位积分 >= 300 and 段位积分 <=399 :
        print('您的段位是：黄金')
    elif 段位积分 >= 400 and 段位积分 <=499 :
        print('您的段位是：铂金')
    elif 段位积分 >= 500 and 段位积分 <=599 :
        print('您的段位是：钻石')
    elif 段位积分 >= 600 and 段位积分 <=699 :
        print('您的段位是：星耀')
    elif 段位积分 >= 700 and 段位积分 <=799 :
        print('您的段位是：王者')
    else :
        print('您的段位积分不符合要求，请输入0~799的段位积分')

duanwi()